# GetCurrentUserId

## Description
Get the user id for the current user.

```pascal
FUNCTION GetCurrentUserId(VAR userid : STRING) : BOOLEAN;
```

```python

def vs.GetCurrentUserId():
    return (BOOLEAN, userid)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|userid|STRING||

## Returns
True on success, false on failure

## Version
Availability: from Vectorworks 2016
## Category
* Project Sharing